       IDENTIFICATION DIVISION.
       PROGRAM-ID. LEAP.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 BISESTILE     USAGE SIGNED-INT.
            88 B-CHECK  VALUE 0.  
       01 SECOLO        USAGE SIGNED-INT.
            88 S-CHECK  VALUE 0.
       01 S-BISESTILE   USAGE SIGNED-INT.
            88 SB-CHECK VALUE 0.
       01 WS-YEAR       USAGE SIGNED-INT.
       01 WS-RESULT     PIC 9(01) VALUE 0.
       01 TEMP          USAGE SIGNED-INT.     
       PROCEDURE DIVISION.
       LEAP.
          MOVE 0 TO WS-RESULT.
          DIVIDE WS-YEAR BY 4   GIVING TEMP REMAINDER BISESTILE.
          DIVIDE WS-YEAR BY 100 GIVING TEMP REMAINDER SECOLO.
          DIVIDE WS-YEAR BY 400 GIVING TEMP REMAINDER S-BISESTILE.
          IF B-CHECK AND NOT S-CHECK
             MOVE 1 TO WS-RESULT
          ELSE
             IF SB-CHECK
                MOVE 1 TO WS-RESULT
             END-IF
          END-IF.
       LEAP-EXIT.
         STOP RUN.
